{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "http://10.100.34.19:9988 neo4j, testing w full data, around 75g\n",
    "from 03, adjusting spark resources and testing with different amount of data\n",
    "\n",
    "https://stackoverflow.com/questions/44590284/number-of-executors-in-spark-local-mode\n",
    "\n",
    "in local mode spark UI shows one driver and all cores, and none of the executors\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T07:27:16.661122Z",
     "start_time": "2019-04-23T07:27:15.920Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Types will be printed.\n"
     ]
    }
   ],
   "source": [
    "%showtypes on"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T09:11:41.352030Z",
     "start_time": "2019-04-23T09:11:10.804Z"
    }
   },
   "outputs": [],
   "source": [
    "import org.neo4j.spark._\n",
    "import org.apache.spark.sql.types._\n",
    "import org.apache.spark.sql.functions._\n",
    "import org.apache.spark.sql.{SQLContext, Row, SaveMode}\n",
    "import org.apache.spark.graphx._\n",
    "import org.apache.spark.graphx.lib._\n",
    "import org.apache.spark.{SparkConf, SparkContext}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Setting spark resources\n",
    "- https://stackoverflow.com/questions/29940711/apache-spark-setting-executor-instances-does-not-change-the-executors\n",
    "- https://stackoverflow.com/questions/32621990/what-are-workers-executors-cores-in-spark-standalone-cluster\n",
    "- https://medium.com/@thejasbabu/spark-under-the-hood-partition-d386aaaa26b7\n",
    "- https://stackoverflow.com/questions/24622108/apache-spark-the-number-of-cores-vs-the-number-of-executors\n",
    "\n",
    "\n",
    "\n",
    "### executors\n",
    "    kg@bigdata-009>\n",
    "    CPU(s):       64\n",
    "    Mem:          252G\n",
    "    \n",
    "     <name>yarn.nodemanager.resource.memory-mb</name>\n",
    "     <value>64960</value>\n",
    "\n",
    "     <name>yarn.scheduler.maximum-allocation-vcores</name>\n",
    "     <value>360</value>\n",
    "     \n",
    "     <name>yarn.nodemanager.resource.cpu-vcores</name>\n",
    "     <value>36</value>\n",
    "     \n",
    "- You can assign the number of cores per executor with `--executor-cores`\n",
    "- `yarn.nodemanager.resource.memory-mb` needs to be larger than `--executor-memory`\n",
    "- Setting `spark.executor.*` only applied to `yarn` and not local\n",
    "- seems better to have 3 or 4 executors per node, instead of 1 executors per node\n",
    "- on each node leave ~10% memory and cpu for yarn and other overheads\n",
    "- TODO: unsolved whether spark.executor.cores refers to core or vcore, can test by setting spark.executor.cores to be large number, eg 340, and if executor still can be allocated then it refers to vcore \n",
    "\n",
    "- yarn.scheduler.maximum-allocation-vcores controls the maximum vcores that any submitted job can request. yarn.nodemanager.resource.cpu-vcores, on the other hand, controls how many vcores can be scheduled on a particular NodeManager instance. \n",
    "\n",
    "### partitions\n",
    "- The recommend number of partitions is around 3 or 4 times the number of CPUs in the cluster"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T07:27:40.151554Z",
     "start_time": "2019-04-23T07:27:38.050Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Spark web UI: http://10.100.34.19:4040/ (or 4041...)\n",
      "(spark.neo4j.bolt.url,bolt://neo4j:neo4j0fcredithc@10.100.34.19:9989)\n",
      "(spark.yarn.queue,kg)\n",
      "(spark.driver.extraClassPath,file:///usr/local/spark/jars-sd/neo4j-spark-connector-full-2.0.0-M2-s_1.6.1.jar,file:///usr/local/spark/jars-sd/scala-pickling_2.10-0.10.1.jar,file:///usr/local/spark/jars-sd/netty-all-4.1.8.Final.jar,file:///usr/local/spark/jars-sd/neo4j-java-driver-1.7.2.jar,file:///usr/local/spark/jars-sd/graphframes-0.5.0-spark1.6-s_2.10.jar,file:///usr/local/spark/jars-sd/scala-logging-api_2.10-2.1.2.jar,file:///usr/local/spark/jars-sd/scala-logging-slf4j_2.10-2.1.2.jar,file:///usr/local/spark/jars-sd/scala-reflect-2.10.4.jar,file:///usr/local/spark/jars-sd/slf4j-api-1.7.7.jar)\n",
      "(spark.executor.id,driver)\n",
      "(spark.driver.extraJavaOptions,-Xms1024M -Xmx4096M -Dlog4j.logLevel=info)\n",
      "(spark.neo4j.bolt.password,neo4j0fcredithc)\n",
      "(spark.driver.host,10.100.34.19)\n",
      "(spark.executor.cores,4)\n",
      "(spark.neo4j.bolt.user,neo4j)\n",
      "(spark.jars,file:///usr/local/spark/jars-sd/neo4j-spark-connector-full-2.0.0-M2-s_1.6.1.jar,file:///usr/local/spark/jars-sd/scala-pickling_2.10-0.10.1.jar,file:///usr/local/spark/jars-sd/netty-all-4.1.8.Final.jar,file:///usr/local/spark/jars-sd/neo4j-java-driver-1.7.2.jar,file:///usr/local/spark/jars-sd/graphframes-0.5.0-spark1.6-s_2.10.jar,file:///usr/local/spark/jars-sd/scala-logging-api_2.10-2.1.2.jar,file:///usr/local/spark/jars-sd/scala-logging-slf4j_2.10-2.1.2.jar,file:///usr/local/spark/jars-sd/scala-reflect-2.10.4.jar,file:///usr/local/spark/jars-sd/slf4j-api-1.7.7.jar,file:/opt/conda/share/jupyter/kernels/apache_toree_scala/lib/toree-assembly-0.1.0-incubating.jar)\n",
      "(spark.executor.port,9993)\n",
      "(spark.fileserver.port,9994)\n",
      "(spark.replClassServer.port,9995)\n",
      "(spark.master,local[40])\n",
      "(spark.submit.deployMode,client)\n",
      "(spark.driver.port,9992)\n",
      "(spark.externalBlockStore.folderName,spark-09eec977-43f4-4d73-bb08-a66a17f40f35)\n",
      "(spark.broadcast.port,9991)\n",
      "(spark.driver.blockManager.port,9990)\n",
      "(spark.app.id,local-1556004458922)\n",
      "(spark.app.name,org.apache.toree.Main)\n",
      "(spark.executor.instances,9)\n",
      "(spark.executor.memory,50g)\n",
      "(Phone,22173769)\n",
      "(Person,19342651)\n",
      "(Mobilephone,18822274)\n",
      "(HC_intopiece_link,15040832)\n",
      "(Address,7976921)\n",
      "(HC_client_mes,6216762)\n",
      "(HC_intopiece,5308780)\n",
      "(ID_card,4194817)\n",
      "(HC_client,4112976)\n",
      "(Landline,3351495)\n",
      "(Company,2892023)\n",
      "(HC_contract,2185195)\n",
      "(HC_repay,1963947)\n",
      "(Bank_account,1868242)\n",
      "(Email,1137400)\n",
      "(HC_staff,177505)\n",
      "(HC_blacklist,94850)\n",
      "(HC_graylist,55464)\n",
      "(HC_presona,8279)\n",
      "(HC_role,206)\n"
     ]
    }
   ],
   "source": [
    "sc.stop()\n",
    "val conf = new SparkConf().set(\"spark.master\",\"local[40]\").set(\"spark.executor.instances\", \"9\").set(\"spark.executor.cores\", \"4\").set(\"spark.executor.memory\", \"50g\")\n",
    "  \n",
    "val sc = new SparkContext(conf)\n",
    "val sqlContext = new org.apache.spark.sql.SQLContext(sc)\n",
    "import sqlContext.implicits._\n",
    "\n",
    "val neo = Neo4j(sc)\n",
    "\n",
    "println(\"Spark web UI: \" + \"http://10.100.34.19:4040/ (or 4041...)\") //spark web UI\n",
    "sc.getConf.getAll.foreach(println)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T07:30:41.799804Z",
     "start_time": "2019-04-23T07:27:45.586Z"
    }
   },
   "outputs": [],
   "source": [
    "// val query = \"MATCH p=()-[r:Person_relation]->() RETURN count(r)\"\n",
    "// val query = \"MATCH (n:Person) RETURN count(n)\"\n",
    "\n",
    "val query = s\"\"\"MATCH (a) WITH DISTINCT LABELS(a) AS temp, COUNT(a) AS tempCnt\n",
    "UNWIND temp AS label\n",
    "RETURN label, SUM(tempCnt) AS cnt\"\"\"\n",
    "\n",
    "val cursor = Executor.execute(sc, query, Map((\"\",\"\")))\n",
    "val response = cursor.rows.toList\n",
    "\n",
    "val label_counts = response.sortWith(_(1).asInstanceOf[Long] > _(1).asInstanceOf[Long])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T07:57:28.551457Z",
     "start_time": "2019-04-23T07:57:27.901Z"
    },
    "deletable": false,
    "editable": false,
    "run_control": {
     "frozen": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+--------+\n",
      "|               _1|      _2|\n",
      "+-----------------+--------+\n",
      "|            Phone|22173769|\n",
      "|           Person|19342651|\n",
      "|      Mobilephone|18822274|\n",
      "|HC_intopiece_link|15040832|\n",
      "|          Address| 7976921|\n",
      "|    HC_client_mes| 6216762|\n",
      "|     HC_intopiece| 5308780|\n",
      "|          ID_card| 4194817|\n",
      "|        HC_client| 4112976|\n",
      "|         Landline| 3351495|\n",
      "|          Company| 2892023|\n",
      "|      HC_contract| 2185195|\n",
      "|         HC_repay| 1963947|\n",
      "|     Bank_account| 1868242|\n",
      "|            Email| 1137400|\n",
      "|         HC_staff|  177505|\n",
      "|     HC_blacklist|   94850|\n",
      "|      HC_graylist|   55464|\n",
      "|       HC_presona|    8279|\n",
      "|          HC_role|     206|\n",
      "+-----------------+--------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "// // Pickling example\n",
    "// label_counts.foreach(row => println(row.deep.mkString(\"\\t\\t\")))\n",
    "// val label_counts_casted:List[(String,String)] = label_counts.map(el => (el(0).toString,el(1).toString))\n",
    "// val label_counts_df = sc.parallelize(label_counts_casted,1).toDS().toDF()\n",
    "// label_counts_df.write.mode(\"overwrite\").save(\"file:///home/jovyan/work/hadoop-client-scala-prod/pickles/label_counts_df.pickle\")\n",
    "// // val label_counts_df = sqlContext.read.load(\"file:///home/jovyan/work/hadoop-client-scala-prod/pickles/label_counts_df.pickle\")\n",
    "// label_counts_df.show\n",
    "// label_counts_df.collect.foreach(el => println(el(0), el(1)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T09:11:39.462521Z",
     "start_time": "2019-04-23T09:00:39.926Z"
    }
   },
   "outputs": [],
   "source": [
    "val label_rel_counts = label_counts.map( row => {\n",
    "    val str = row(0)\n",
    "    val query = s\"MATCH (n:$str)-[r]-() return COUNT(r)\"\n",
    "    val cursor = Executor.execute(sc, query, Map((\"\",\"\")))\n",
    "    val response = cursor.rows.toList\n",
    "    row :+ response(0)(0)\n",
    "})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-24T06:50:07.538507Z",
     "start_time": "2019-04-24T06:50:05.499Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+--------+---------+\n",
      "|            label| count_n|  count_r|\n",
      "+-----------------+--------+---------+\n",
      "|            Phone|22173769| 51227904|\n",
      "|           Person|19342651|140069325|\n",
      "|      Mobilephone|18822274| 42658529|\n",
      "|HC_intopiece_link|15040832|        0|\n",
      "|          Address| 7976921| 18842999|\n",
      "|    HC_client_mes| 6216762| 10353541|\n",
      "|     HC_intopiece| 5308780| 80801782|\n",
      "|          ID_card| 4194817|  9779910|\n",
      "|        HC_client| 4112976| 70850813|\n",
      "|         Landline| 3351495|  8569375|\n",
      "|          Company| 2892023| 21315735|\n",
      "|      HC_contract| 2185195|  2180338|\n",
      "|         HC_repay| 1963947|        0|\n",
      "|     Bank_account| 1868242|  2801423|\n",
      "|            Email| 1137400|  1169363|\n",
      "|         HC_staff|  177505|   718550|\n",
      "|     HC_blacklist|   94850|        0|\n",
      "|      HC_graylist|   55464|        0|\n",
      "|       HC_presona|    8279|  5504220|\n",
      "|          HC_role|     206|        0|\n",
      "+-----------------+--------+---------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "val dataToSave = label_rel_counts.map(row => row.map(el => el.toString))\n",
    "\n",
    "val schemaString = \"label count_n count_r\"\n",
    "\n",
    "// Generate the schema based on the string of schema\n",
    "val schema =\n",
    "  StructType(\n",
    "    schemaString.split(\" \").map(fieldName => StructField(fieldName, StringType, true)))\n",
    "\n",
    "// Convert records of the RDD to Rows.\n",
    "val dataRDDToSave = dataToSave.map(p => Row(p: _*)) // using splat is easier\n",
    "\n",
    "val dfToSave = sqlContext.createDataFrame(sc.parallelize(dataRDDToSave:List[Row]), schema)\n",
    "\n",
    "dfToSave.write.mode(\"overwrite\").save(\"file:///home/jovyan/work/hadoop-client-scala-prod/pickles/label_rel_counts_df.pickle\")\n",
    "\n",
    "dfToSave.show"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-24T06:50:53.603622Z",
     "start_time": "2019-04-24T06:50:52.394Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+--------+---------+\n",
      "|            label| count_n|  count_r|\n",
      "+-----------------+--------+---------+\n",
      "|          Address| 7976921| 18842999|\n",
      "|     HC_blacklist|   94850|        0|\n",
      "|      HC_contract| 2185195|  2180338|\n",
      "|       HC_presona|    8279|  5504220|\n",
      "|         HC_staff|  177505|   718550|\n",
      "|HC_intopiece_link|15040832|        0|\n",
      "|            Email| 1137400|  1169363|\n",
      "|      Mobilephone|18822274| 42658529|\n",
      "|     HC_intopiece| 5308780| 80801782|\n",
      "|          HC_role|     206|        0|\n",
      "|            Phone|22173769| 51227904|\n",
      "|     Bank_account| 1868242|  2801423|\n",
      "|         Landline| 3351495|  8569375|\n",
      "|         HC_repay| 1963947|        0|\n",
      "|          Company| 2892023| 21315735|\n",
      "|      HC_graylist|   55464|        0|\n",
      "|          ID_card| 4194817|  9779910|\n",
      "|           Person|19342651|140069325|\n",
      "|    HC_client_mes| 6216762| 10353541|\n",
      "|        HC_client| 4112976| 70850813|\n",
      "+-----------------+--------+---------+\n",
      "\n",
      "(Address,7976921)\n",
      "(HC_blacklist,94850)\n",
      "(HC_contract,2185195)\n",
      "(HC_presona,8279)\n",
      "(HC_staff,177505)\n",
      "(HC_intopiece_link,15040832)\n",
      "(Email,1137400)\n",
      "(Mobilephone,18822274)\n",
      "(HC_intopiece,5308780)\n",
      "(HC_role,206)\n",
      "(Phone,22173769)\n",
      "(Bank_account,1868242)\n",
      "(Landline,3351495)\n",
      "(HC_repay,1963947)\n",
      "(Company,2892023)\n",
      "(HC_graylist,55464)\n",
      "(ID_card,4194817)\n",
      "(Person,19342651)\n",
      "(HC_client_mes,6216762)\n",
      "(HC_client,4112976)\n"
     ]
    }
   ],
   "source": [
    "val loaded_df = sqlContext.read.load(\"file:///home/jovyan/work/hadoop-client-scala-prod/pickles/label_rel_counts_df.pickle\")\n",
    "loaded_df.show\n",
    "loaded_df.collect.foreach(el => println(el(0), el(1)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T09:22:19.627902Z",
     "start_time": "2019-04-23T09:22:19.249Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Name: Compile Error\n",
       "Message: <console>:96: error: type mismatch;\n",
       " found   : List[Seq[Any]]\n",
       " required: List[Seq[String]]\n",
       "         val temp_casted:List[Seq[String]] = label_rel_counts.map(el => Row(el:_*).toSeq)\n",
       "                                                                 ^\n",
       "StackTrace: "
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val temp_casted:List[Row] = label_rel_counts.map(el => Row(el:_*))\n",
    "val temp_casted:List[Seq[String]] = label_rel_counts.map(el => Row(el:_*).toSeq)\n",
    "\n",
    "val label_rel_counts_df = sc.parallelize(temp_casted,1).toDS().toDF()\n",
    "// label_counts_df.write.mode(\"overwrite\").save(\"file:///home/jovyan/work/hadoop-client-scala-prod/pickles/label_counts_df.pickle\")\n",
    "// // val label_counts_df = sqlContext.read.load(\"file:///home/jovyan/work/hadoop-client-scala-prod/pickles/label_counts_df.pickle\")\n",
    "label_rel_counts_df.show\n",
    "// label_counts_df.collect.foreach(el => println(el(0), el(1)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-22T10:02:23.762366Z",
     "start_time": "2019-04-22T10:02:23.494Z"
    },
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+--------+---------+\n",
      "|            label|count(n)| count(r)|\n",
      "+-----------------+--------+---------+\n",
      "|            Phone|22173769| 51227904|\n",
      "|           Person|19342651|140069325|\n",
      "|      Mobilephone|18822274| 42658529|\n",
      "|HC_intopiece_link|15040832|        0|\n",
      "|          Address| 7976921| 18842999|\n",
      "|    HC_client_mes| 6216762| 10353541|\n",
      "|     HC_intopiece| 5308780| 80801782|\n",
      "|          ID_card| 4194817|  9779910|\n",
      "|        HC_client| 4112976| 70850813|\n",
      "|         Landline| 3351495|  8569375|\n",
      "|          Company| 2892023| 21315735|\n",
      "|      HC_contract| 2185195|  2180338|\n",
      "|         HC_repay| 1963947|        0|\n",
      "|     Bank_account| 1868242|  2801423|\n",
      "|            Email| 1137400|  1169363|\n",
      "|         HC_staff|  177505|   718550|\n",
      "|     HC_blacklist|   94850|        0|\n",
      "|      HC_graylist|   55464|        0|\n",
      "|       HC_presona|    8279|  5504220|\n",
      "|          HC_role|     206|        0|\n",
      "+-----------------+--------+---------+"
     ]
    }
   ],
   "source": [
    "print(Tabulator.format(Array[Any](\"label\",\"count(n)\",\"count(r)\") +: label_rel_counts))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-22T10:03:20.155345Z",
     "start_time": "2019-04-22T10:03:19.754Z"
    },
    "deletable": false,
    "editable": false,
    "run_control": {
     "frozen": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-------------+--------+---------+\n",
      "|        label|count(n)| count(r)|\n",
      "+-------------+--------+---------+\n",
      "|        Phone|22173769| 51227904|\n",
      "|       Person|19342651|140069325|\n",
      "|  Mobilephone|18822274| 42658529|\n",
      "|      Address| 7976921| 18842999|\n",
      "|HC_client_mes| 6216762| 10353541|\n",
      "| HC_intopiece| 5308780| 80801782|\n",
      "|      ID_card| 4194817|  9779910|\n",
      "|    HC_client| 4112976| 70850813|\n",
      "|     Landline| 3351495|  8569375|\n",
      "|      Company| 2892023| 21315735|\n",
      "|  HC_contract| 2185195|  2180338|\n",
      "| Bank_account| 1868242|  2801423|\n",
      "|        Email| 1137400|  1169363|\n",
      "|     HC_staff|  177505|   718550|\n",
      "|   HC_presona|    8279|  5504220|\n",
      "+-------------+--------+---------+"
     ]
    }
   ],
   "source": [
    "val label_rel_counts_no_zero = label_rel_counts.filter(_(2)!=0)\n",
    "print(Tabulator.format(Array[Any](\"label\",\"count(n)\",\"count(r)\") +: label_rel_counts_no_zero))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T03:43:07.634716Z",
     "start_time": "2019-04-23T03:43:07.448Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "List[Array[Any]] = List(Array(Phone, 22173769), Array(Person, 19342651), Array(Mobilephone, 18822274), Array(HC_intopiece_link, 15040832), Array(Address, 7976921), Array(HC_client_mes, 6216762), Array(HC_intopiece, 5308780), Array(ID_card, 4194817), Array(HC_client, 4112976), Array(Landline, 3351495), Array(Company, 2892023), Array(HC_contract, 2185195), Array(HC_repay, 1963947), Array(Bank_account, 1868242), Array(Email, 1137400), Array(HC_staff, 177505), Array(HC_blacklist, 94850), Array(HC_graylist, 55464), Array(HC_presona, 8279), Array(HC_role, 206))"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "label_counts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T02:54:56.535724Z",
     "start_time": "2019-04-23T02:54:55.984Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Elapsed time: 0.286s\n"
     ]
    }
   ],
   "source": [
    "val t_start = System.currentTimeMillis()\n",
    "\n",
    "val neo4j: Neo4j = neo.rels(\"MATCH (n:HC_role)-[r]->(m) RETURN id(n) as src, id(m) as dst, type(r) as value SKIP {_skip} LIMIT {_limit}\").partitions(10).batch(20)\n",
    "val graph: Graph[Long, String] = neo4j.loadGraph[Long,String]\n",
    "\n",
    "val t_end = System.currentTimeMillis()\n",
    "println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-23T02:55:03.157058Z",
     "start_time": "2019-04-23T02:55:02.890Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Long = 0"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.vertices.count"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-15T09:55:45.091353Z",
     "start_time": "2019-04-15T09:55:44.935Z"
    }
   },
   "outputs": [],
   "source": [
    "// divided by 40 cores\n",
    "32697950/40"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-15T09:59:10.554552Z",
     "start_time": "2019-04-15T09:59:10.259Z"
    }
   },
   "outputs": [],
   "source": [
    "val neo4j: Neo4j = neo.rels(\"MATCH (n:Person)-[r:Person_relation]->(m:Person) RETURN id(n) as src, id(m) as dst, type(r) as value SKIP {_skip} LIMIT {_limit}\").partitions(40).batch(850000)\n",
    "val graph: Graph[Long, String] = neo4j.loadGraph[Long,String]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-15T10:05:46.373913Z",
     "start_time": "2019-04-15T09:59:29.659Z"
    }
   },
   "outputs": [],
   "source": [
    "val t_start = System.currentTimeMillis()\n",
    "\n",
    "println(graph.vertices.count)\n",
    "\n",
    "val t_end = System.currentTimeMillis()\n",
    "println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-15T10:14:21.215679Z",
     "start_time": "2019-04-15T10:11:03.345Z"
    }
   },
   "outputs": [],
   "source": [
    "val t_start = System.currentTimeMillis()\n",
    "\n",
    "println(graph.edges.count)\n",
    "\n",
    "val t_end = System.currentTimeMillis()\n",
    "println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## pattern is using `id(n)` if node property is set to null, like example below"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-15T10:41:11.666615Z",
     "start_time": "2019-04-15T10:41:10.757Z"
    },
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "val t_start = System.currentTimeMillis()\n",
    "\n",
    "// val g = Neo4jGraph.loadGraph(sc, \"Person\", Seq(\"Person_relation\"), \"Person\")\n",
    "val graph = neo.pattern((\"Person\",null),(\"Person_relation\",null),(\"Person\",null)).partitions(40).batch(850000).loadGraph[Long,Long]\n",
    "\n",
    "val t_end = System.currentTimeMillis()\n",
    "println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-15T10:26:46.994662Z",
     "start_time": "2019-04-15T10:18:01.603Z"
    }
   },
   "outputs": [],
   "source": [
    "// 1513901\n",
    "val t_start = System.currentTimeMillis()\n",
    "\n",
    "println(graph.vertices.count)\n",
    "\n",
    "val t_end = System.currentTimeMillis()\n",
    "println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-15T10:48:14.156199Z",
     "start_time": "2019-04-15T10:41:13.389Z"
    }
   },
   "outputs": [],
   "source": [
    "// 1513901\n",
    "val t_start = System.currentTimeMillis()\n",
    "\n",
    "println(graph.edges.count)\n",
    "\n",
    "val t_end = System.currentTimeMillis()\n",
    "println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "// val t_start = System.currentTimeMillis()\n",
    "\n",
    "// // Find the connected components\n",
    "// val g2 = g.connectedComponents()\n",
    "\n",
    "// val t_end = System.currentTimeMillis()\n",
    "// println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "// g2.vertices.take(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "// val t_start = System.currentTimeMillis()\n",
    "\n",
    "// val return_val = Neo4jGraph.saveGraph(sc, g2, \"sdComponent\")\n",
    "// println(return_val) // how many nodes has been written\n",
    "\n",
    "// val t_end = System.currentTimeMillis()\n",
    "// println(\"Elapsed time: \" + (t_end - t_start)/1000d + \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "//   // label1, label2, relTypes are optional\n",
    "//   // MATCH (n:${label(label1}})-[via:${rels(relTypes)}]->(m:${label(label2)}) RETURN id(n) as from, id(m) as to\n",
    "//   def loadGraph(sc: SparkContext, label1: String, relTypes: Seq[String], label2: String) : Graph[Any,Int] = {\n",
    "//     def label(l : String) = if (l == null) \"\" else \":`\"+l+\"`\"\n",
    "//     def rels(relTypes : Seq[String]) = relTypes.map(\":`\"+_+\"`\").mkString(\"|\")\n",
    "\n",
    "//     val relStmt = s\"MATCH (n${label(label1)})-[via${rels(relTypes)}]->(m${label(label2)}) RETURN id(n) as from, id(m) as to\"\n",
    "\n",
    "//     loadGraphFromNodePairs[Any](sc,relStmt)\n",
    "//   }"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Toree - Scala (local[20])",
   "language": "scala",
   "name": "apache_toree_scala"
  },
  "language_info": {
   "name": "scala",
   "version": "2.10.4"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  },
  "varInspector": {
   "cols": {
    "lenName": 16,
    "lenType": 16,
    "lenVar": 40
   },
   "kernels_config": {
    "python": {
     "delete_cmd_postfix": "",
     "delete_cmd_prefix": "del ",
     "library": "var_list.py",
     "varRefreshCmd": "print(var_dic_list())"
    },
    "r": {
     "delete_cmd_postfix": ") ",
     "delete_cmd_prefix": "rm(",
     "library": "var_list.r",
     "varRefreshCmd": "cat(var_dic_list()) "
    }
   },
   "types_to_exclude": [
    "module",
    "function",
    "builtin_function_or_method",
    "instance",
    "_Feature"
   ],
   "window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
